**1**. Connect to the SQLite3 database at `data/faculty.db` using the `sqlite` package or `ipython-sql` magic functions.

In [31]:
%load_ext sql
%sql sqlite:///faculty.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @faculty.db'

In [32]:
%%sql
SELECT * 
FROM sqlite_master

 * sqlite:///faculty.db
Done.

[('table', 'person', 'person', 2, 'CREATE TABLE person (\n\t"index" BIGINT, \n\tperson_id BIGINT, \n\tfirst TEXT, \n\tlast TEXT, \n\tage BIGINT, \n\theight FLOAT, \n\tweight BIGINT, \n\tcountry_id TEXT, \n\tgender_id BIGINT\n)'),
 ('index', 'ix_person_index', 'person', 3, 'CREATE INDEX ix_person_index ON person ("index")'),
 ('table', 'confidential', 'confidential', 18, 'CREATE TABLE confidential (\n\t"index" BIGINT, \n\tperson_id BIGINT, \n\tsalary BIGINT\n)'),
 ('index', 'ix_confidential_index', 'confidential', 24, 'CREATE INDEX ix_confidential_index ON confidential ("index")'),
 ('table', 'person_language', 'person_language', 33, 'CREATE TABLE person_language (\n\t"index" BIGINT, \n\tperson_id BIGINT, \n\tlanguage_id BIGINT\n)'),
 ('index', 'ix_person_language_index', 'person_language', 34, 'CREATE INDEX ix_person_language_index ON person_language ("index")'),
 ('table', 'language', 'language', 50, 'CREATE TABLE language (\n\t"index" BIGINT, \n\tlanguage_id BIGINT, \n\tlanguage_name TEXT\n)'),
 ('index', 'ix_language_index', 'language', 54, 'CREATE INDEX ix_language_index ON language ("index")'),
 ('table', 'gender', 'gender', 55, 'CREATE TABLE gender (\n\t"index" BIGINT, \n\tgender_id BIGINT, \n\tgender TEXT\n)'),
 ('index', 'ix_gender_index', 'gender', 56, 'CREATE INDEX ix_gender_index ON gender ("index")'),
 ('table', 'country', 'country', 57, 'CREATE TABLE country (\n\t"index" BIGINT, \n\tcountry_id TEXT, \n\tcountry TEXT, \n\tnationality TEXT\n)'),
 ('index', 'ix_country_index', 'country', 58, 'CREATE INDEX ix_country_index ON country ("index")'),
 ('view', 'langauge_view', 'langauge_view', 0, 'CREATE VIEW langauge_view AS\nSELECT first, last, language_name \nFROM person\nINNER JOIN person_language ON person.person_id = person_language.person_id\nINNER JOIN language ON language.language_id = person_language.language_id'),
 ('view', 'language_view', 'language_view', 0, 'CREATE VIEW language_view AS\nSELECT first, last, language_name \nFROM person\nINNER JOIN person_language \n    ON person.person_id = person_language.person_id\nINNER JOIN language \n    ON language.language_id = person_language.language_id')]

2. Find the youngest and oldest faculty member of each gender.

Youngest and then oldest males.

In [33]:
%%sql
SELECT first, last, age
FROM person
WHERE gender_id = 0
ORDER BY age
LIMIT 1

 * sqlite:///faculty.db
Done.

[('Antoine', 'Beard', 16)]

In [34]:
%%sql
SELECT first, last, age
FROM person
WHERE gender_id = 0
ORDER BY age DESC
LIMIT 1

 * sqlite:///faculty.db
Done.

[('Antony', 'Gregory', 66)]

Youngest and then oldest females.

In [35]:
%%sql
SELECT first, last, age
FROM person
WHERE gender_id = 1
ORDER BY age
LIMIT 1

 * sqlite:///faculty.db
Done.

[('Chery', 'Becker', 16)]

In [36]:
%%sql
SELECT first, last, age
FROM person
WHERE gender_id = 1
ORDER BY age DESC
LIMIT 1

 * sqlite:///faculty.db
Done.

[('Alyse', 'Gamble', 66)]

3. Find the median age of the faculty members who know Python.

As SQLite3 does not provide a median function, you can create a User Defined Function (UDF) to do this. See [documentation](https://docs.python.org/2/library/sqlite3.html#sqlite3.Connection.create_function).

In [96]:
%%sql
SELECT avg(age)
FROM (SELECT age
      FROM person
      ORDER BY age
      WHERE 
      LIMIT 2 - (SELECT COUNT(*) FROM person) % 2    -- odd 1, even 2
      OFFSET (SELECT (COUNT(*) - 1) / 2
              FROM person))

 * sqlite:///faculty.db
Done.

[(41.0,)]

4. Arrange countries by the average age of faculty in descending order. Countries are only included in the table if there are at least 3 faculty members from that country.

In [42]:
%%sql
SELECT country_id, avg(age)
FROM person
GROUP BY country_id
ORDER BY avg(age) desc

 * sqlite:///faculty.db
Done.

[('HK', 48.785714285714285),
 ('UY', 45.36842105263158),
 ('ME', 44.77777777777778),
 ('IS', 44.26315789473684),
 ('UA', 44.17391304347826),
 ('GB', 44.1025641025641),
 ('CH', 43.357142857142854),
 ('EE', 43.17948717948718),
 ('BE', 43.08108108108108),
 ('CL', 42.83783783783784),
 ('IR', 42.53658536585366),
 ('DK', 42.48936170212766),
 ('IE', 42.43859649122807),
 ('DE', 42.41025641025641),
 ('VE', 42.0),
 ('NL', 41.8936170212766),
 ('CU', 41.48936170212766),
 ('SE', 41.404761904761905),
 ('ET', 41.25),
 ('RO', 41.1764705882353),
 ('CA', 41.111111111111114),
 ('AU', 40.878787878787875),
 ('CM', 40.74390243902439),
 ('RU', 40.61904761904762),
 ('GR', 40.59375),
 ('SP', 40.56410256410256),
 ('DM', 40.45238095238095),
 ('FI', 40.391304347826086),
 ('PO', 39.93181818181818),
 ('JO', 39.921052631578945),
 ('BO', 39.85),
 ('EG', 39.67741935483871),
 ('TW', 39.0),
 ('FR', 38.47222222222222),
 ('JP', 37.4375),
 ('BR', 37.21212121212121),
 ('CR', 36.54838709677419),
 ('IT', 35.42857142857143)]

5. Which country has the most highest average body mass index (BMII) among the faculty? Recall that BMI is weight (kg) / (height (m))^2.

In [46]:
%%sql
SELECT country_id, avg(weight/(height*height))
FROM person
GROUP BY country_id
ORDER BY avg(weight/(height*height)) desc
LIMIT 1

 * sqlite:///faculty.db
Done.

[('HK', 24.54940412907561)]

6. Do obese faculty (BMI > 30) know more languages on average than non-obese faculty?

Obese Faculty know fewer languages on average!

In [87]:
%%sql
SELECT AVG (langs)
FROM
    (SELECT COUNT(DISTINCT(person_language.language_id)) as langs
    FROM person_language
    JOIN person
    ON person.person_id = person_language.person_id
    WHERE(person.weight/(person.height*person.height))>30
    GROUP BY person_language.person_id
    ORDER BY COUNT(DISTINCT(person_language.language_id)) desc)

 * sqlite:///faculty.db
Done.

[(1.9508196721311475,)]

Non-obese faculty know lightly more languages.

In [90]:
%%sql
SELECT AVG (langs)
FROM
    (SELECT COUNT(DISTINCT(person_language.language_id)) as langs
    FROM person_language
    JOIN person
    ON person.person_id = person_language.person_id
    WHERE(person.weight/(person.height*person.height))<30
    GROUP BY person_language.person_id
    ORDER BY COUNT(DISTINCT(person_language.language_id)) desc)

 * sqlite:///faculty.db
Done.

[(1.9644230769230768,)]